sdsxpln/TM4C129-discontinued/libraries/fatfs/port/FreeRTOS+IO/mmc.c
/*-----------------------------------------------------------------------
 Original MMCv3/SDv1/SDv2 (in SPI mode) control module  (C)ChaN, 2007
 FreeRTOS+IO version by Real Time Engineers ltd (http://www.FreeRTOS.org)

 Note:  While this file has been reworked as a demonstration of how to use
 FreeRTOS+IO, it does *not* fully comply with the FreeRTOS coding standard.
-----------------------------------------------------------------------*/

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/gpio.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/ssi.h"
#include "driverlib/sysctl.h"
#include "diskio.h"

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

/* FreeRTOS+IO library includes. */
#include "FreeRTOS_IO.h"

/* Place holder for calls to ioctl that don't use the value parameter. */
#define mmcPARAMETER_NOT_USED			( ( void * ) 0 )

/* Clock speed to use before the card type is determined. */
#define mmcSD_INTERFACE_SLOW_CLOCK		100000UL

/* Clock speed to use after the card type has been determined. */
#define mmcSD_INTERFACE_FAST_CLOCK		boardSD_INTERFACE_FAST_CLOCK

/* Misc constants required by the MMC SPI protocol. */
#define mmc80_CLOCKS_IN_BYTES			( 10 )
#define mmcCOMMAND_LENGTH_BYTES			6
#define mmcOCR_LENGTH					4
#define mmcMAX_QUERY_STRING_BYTES		16
#define mmcSECTOR_SIZE					512
#define mmcDATA_BLOCK_SIZE				mmcSECTOR_SIZE

/* When queried, the card always responds that its power is on. */
#define prvPowerOn()
#define prvPowerOff()
#define mmcPOWER_ON						1

/* Definitions for MMC/SDC command */
#define CMD0_SOFTWARE_RESET				( 0x40+0 )	/* GO_IDLE_STATE */
#define CMD1_START_INITIALISE_MMC		( 0x40+1 )	/* SEND_OP_COND (MMC) */
#define	CMD41_START_INIT_SDC			( 0xC0+41 )	/* SEND_OP_COND (SDC) */
#define CMD8_CHECK_VOLTAGE_RANGE	    ( 0x40+8 )	/* SEND_IF_COND */
#define CMD9_READ_CSD_REGISTER			( 0x40+9 )	/* SEND_CSD */
#define CMD10_READ_CID_REGISTER			( 0x40+10 )	/* SEND_CID */
#define CMD12_STOP						( 0x40+12 )	/* STOP_TRANSMISSION */
#define CMD13_READ_SD_STATUS			( 0xC0+13 )	/* SD_STATUS (SDC) */
#define CMD16_CHANGE_RW_BLOCK_SIZE		( 0x40+16 )	/* SET_BLOCKLEN */
#define CMD17_READ_SINGLE_BLOCK			( 0x40+17 )	/* READ_SINGLE_BLOCK */
#define CMD18_READ_MULTI_BLOCK			( 0x40+18 )	/* READ_MULTIPLE_BLOCK */
#define CMD23_SET_BLOCK_COUNT			( 0x40+23 )	/* SET_BLOCK_COUNT (MMC) */
#define	CMD23_SET_ERASE_COUNT			( 0xC0+23 )	/* SET_WR_BLK_ERASE_COUNT (SDC) */
#define CMD24_WRITE_SINGLE_BLOCK	    ( 0x40+24 )	/* WRITE_BLOCK */
#define CMD25_WRITE_MULTI_BLOCK			( 0x40+25 )	/* WRITE_MULTIPLE_BLOCK */
#define CMD55_LEADING_COMMAND_OF_ACMD	( 0x40+55 )	/* APP_CMD */
#define CMD58_READ_OCR					( 0x40+58 )	/* READ_OCR */

/* A block time of 500ms, converted to ticks. */
#define mmc500ms		( ( void * ) ( 500UL / portTICK_RATE_MS ) )

/*-----------------------------------------------------------*/

/*
 * Send the command cCommand, with argument xArgument (if any) to the card.
 */
static BYTE prvSendCommand( BYTE cCommand,	DWORD xArgument	);

/*
 * Deselect the card and release the SPI bus.
 */
static void prvDeselectCard( void );

/*
 * Wait for the card to be read.
 */
static BYTE prvWaitForCardReady( void );

/*
 * Select the card and wait for it to be ready.
 */
static BOOL prvSelectCard( void );

/*
 * Return the power state.  In this case mmcPOWER_ON is always returned as the
 * card is always powered.
 */
static int prvCheckPower( void );

/*
 * Opens and configures the SPI port used to communicate with the SD card.
 * This assumes the port is not already open.  The handle of the opened port
 * is returned.
 */
static Peripheral_Descriptor_t prvConfigureSDInterface( void );

/*
 * Receive a data packet from the card in response to a query command.
 */
static BOOL prvQueryCard( BYTE ucCommand, DWORD ulCommandArgument, BYTE *pucRxBuffer, UINT uiRxLength );

/*
 * Receive a block of data read from the card.
 */
static BOOL prvReceiveDataBlock( BYTE *pcBuffer, UINT xBytesToRead );

/*
 * Write a block of data to the card.
 */
static BOOL prvWriteDataBlock( const BYTE *pcBuffer, BYTE cToken );

/*
 * Check the card is inserted, and set the STA_NODISK bits in the xDiskStatus
 * byte accordingly.  Return pdTRUE if the card is present, and pdFALSE if the
 * card is not present.
 */
static portBASE_TYPE prvIsDiskInserted( void );

/*-----------------------------------------------------------*/

/* The handle to the opened SPI port - required by FreeRTOS+IO calls. */
static Peripheral_Descriptor_t xSPIPort = NULL;

/* Bitwise status for STA_NODISK and STA_NOINIT status of the card. */
static volatile DSTATUS xDiskStatus = STA_NOINIT;

/* Stores the card type discovered during the initialisation process. */
static BYTE ucInsertedCardType = 0U;

/*-----------------------------------------------------------*/

/*-----------------------------------------------------------------------*/
/* Get Disk Status                                                       */
/*-----------------------------------------------------------------------*/
DSTATUS disk_status( BYTE cDriveNumber )
{
DSTATUS xReturn;

	/* This call will update xDiskStatus. */
	prvIsDiskInserted();

	if( cDriveNumber != 0 )
	{
		xReturn = STA_NOINIT;
	}
	else
	{
		xReturn = xDiskStatus;
	}

	return xReturn;
}

/*-----------------------------------------------------------------------*/
/* Initialize Disk Drive                                                 */
/*-----------------------------------------------------------------------*/
DSTATUS disk_initialize ( BYTE cDriveNumber )
{
BYTE cCommand, cCardType;
DSTATUS xReturn = 0;
BYTE ucBuffer[ mmc80_CLOCKS_IN_BYTES + 1 ];
portTickType xTimeAtStart;
const portTickType xTimeOut = 1000UL / portTICK_RATE_MS;

	/* If this is the first time the function has been called the SPI port will
	need opening. */
	if( xSPIPort == NULL )
	{
		xSPIPort = prvConfigureSDInterface();
	}

