sdsxpln/TM4C129-discontinued/libraries/fatfs/port/FreeRTOS+IO/mmc.c
	if( cDriveNumber != 0 )
	{
		/* This driver only supports a single drive. */
		xReturn = STA_NOINIT;
	}
	else if( boardSD_CARD_DETECT() != boardSD_CARD_INSERTED )
	{
		/* Cannot detect a card. */
		xReturn = STA_NODISK;
	}
	else if( ( xDiskStatus & STA_NOINIT ) != 0U )
	{
		/* Force socket power on - this might not do anything depending on the
		hardware. */
		prvPowerOn();

		/* Always start with the slow SPI clock. */
		FreeRTOS_ioctl( xSPIPort, ioctlSET_SPEED, ( void * ) mmcSD_INTERFACE_SLOW_CLOCK );

		/* Wait the obligatory 80 clocks. */
		FreeRTOS_read( xSPIPort, ucBuffer, mmc80_CLOCKS_IN_BYTES );

		cCardType = 0;
		if( prvSendCommand( CMD0_SOFTWARE_RESET, 0 ) == 1 )
		{
			/* Enter Idle state.  Initialization timeout of 1000 msec */
			xTimeAtStart = xTaskGetTickCount();

			if( prvSendCommand( CMD8_CHECK_VOLTAGE_RANGE, 0x1AA ) == 1 )
			{
				/* SDHC */
				/* Get trailing return value of R7 resp */
				FreeRTOS_read( xSPIPort, ucBuffer, mmcOCR_LENGTH );

				if( ( ucBuffer[ 2 ] == 0x01 ) && ( ucBuffer[ 3 ] == 0xAA ) )
				{
					/* The card can work at vdd range of 2.7-3.6V */

					/* Wait for leaving idle state (CMD41_START_INIT_SDC
					with HCS bit) */
					while( ( ( xTaskGetTickCount() - xTimeAtStart ) < xTimeOut ) && ( prvSendCommand( CMD41_START_INIT_SDC, 1UL << 30 ) != 0 ) )
					{
						/* Nothing to do here. */
					}

					if( ( ( xTaskGetTickCount() - xTimeAtStart ) < xTimeOut ) && ( prvSendCommand( CMD58_READ_OCR, 0 ) == 0 ) )
					{
						/* Check CCS bit in the OCR */
						FreeRTOS_read( xSPIPort, ucBuffer, mmcOCR_LENGTH );

						/* SDv2 */
						if( ( ucBuffer[ 0 ] & 0x40 ) != 0 )
						{
							cCardType = CT_SD2 | CT_BLOCK;
						}
						else
						{
							cCardType = CT_SD2;
						}
					}
				}
			}
			else
			{
				/* SDSC or MMC */
				if( prvSendCommand( CMD41_START_INIT_SDC, 0 ) <= 1 )
				{
					/* SDv1 */
					cCardType = CT_SD1;
					cCommand = CMD41_START_INIT_SDC;
				}
				else
				{
					/* MMCv3 */
					cCardType = CT_MMC;
					cCommand = CMD1_START_INITIALISE_MMC;
				}

				while( ( ( xTaskGetTickCount() - xTimeAtStart ) < xTimeOut ) && ( prvSendCommand( cCommand, 0 ) != 0 ) )
				{
					/* Wait for leaving idle state */
				}

				if( ( ( xTaskGetTickCount() - xTimeAtStart ) >= xTimeOut ) || ( prvSendCommand( CMD16_CHANGE_RW_BLOCK_SIZE, mmcSECTOR_SIZE ) != 0 ) )
				{
					/* Set R/W block length to mmcSECTOR_SIZE */
					cCardType = 0;
				}
			}
		}

		ucInsertedCardType = cCardType;
		prvDeselectCard();

		if( cCardType != 0 )
		{
			/* Initialization succeeded.  Clear STA_NOINIT */
			xDiskStatus &= ~STA_NOINIT;
			FreeRTOS_ioctl( xSPIPort, ioctlSET_SPEED, ( void * ) mmcSD_INTERFACE_FAST_CLOCK );
		}
		else
		{
			/* Initialization failed */
			prvPowerOff();
		}

		xReturn = xDiskStatus;
	}

	return xReturn;
}

/*-----------------------------------------------------------------------*/
/* Read Sector(s)                                                        */
/*-----------------------------------------------------------------------*/
DRESULT disk_read
		(
			BYTE	cDriveNumber,	/* Physical drive nmuber (0) */
			BYTE	*pcBuffer,		/* Pointer to the data buffer to store read data */
			DWORD	ulSector, 		/* Start ulSector number (LBA) */
			BYTE	xCount			/* Sector xCount (1..255) */
		)
{
DRESULT xReturn;

	if( ( cDriveNumber != 0 ) || ( xCount == 0 ) )
	{
		xReturn = RES_PARERR;
	}
	else if( ( ( xDiskStatus & STA_NOINIT ) != 0 ) || ( prvIsDiskInserted() != pdTRUE ) )
	{
		xReturn = RES_NOTRDY;
	}
	else
	{
		if( ( ucInsertedCardType & CT_BLOCK ) == 0U )
		{
			/* Convert to byte address if needed */
			ulSector *= mmcSECTOR_SIZE;
		}

		if( xCount == 1 )
		{
			/* Single block read */
			if( prvSendCommand( CMD17_READ_SINGLE_BLOCK, ulSector ) == 0 )
			{
				if( prvReceiveDataBlock( pcBuffer, mmcSECTOR_SIZE ) == TRUE )
				{
					xCount = 0;
				}
			}
		}
		else
		{
			/* Multiple block read */
			if( prvSendCommand( CMD18_READ_MULTI_BLOCK, ulSector ) == 0 )
			{
				do
				{
					if( prvReceiveDataBlock( pcBuffer, mmcSECTOR_SIZE ) == FALSE )
					{
						break;
					}

					pcBuffer += mmcSECTOR_SIZE;
				} while( --xCount );

				prvSendCommand( CMD12_STOP, 0 );
			}
		}

		prvDeselectCard();

		if( xCount > 0 )
		{
			xReturn = RES_ERROR;
		}
		else
		{
			xReturn = RES_OK;
		}
	}

	return xReturn;
}

/*-----------------------------------------------------------------------*/
/* Write Sector(s)                                                       */
/*-----------------------------------------------------------------------*/
#if _FS_READONLY == 0
DRESULT disk_write
		(
			BYTE		cDriveNumber,	/* Physical drive nmuber (0) */
			const BYTE	*pcBuffer,		/* Pointer to the data to be written */
			DWORD		ulSector, 		/* Start ulSector number (LBA) */
			BYTE		xCount			/* Sector xCount (1..255) */
		)
{
DRESULT xReturn;

	if( ( cDriveNumber != 0 ) || ( xCount == 0 ) )
	{
		xReturn = RES_PARERR;
	}
	else if( ( ( xDiskStatus & STA_NOINIT ) != 0 ) || ( prvIsDiskInserted() != pdTRUE ) )
	{
		xReturn = RES_NOTRDY;
	}
	else if( ( xDiskStatus & STA_PROTECT ) != 0 )
	{
		xReturn = RES_WRPRT;
	}
	else
	{
		if( ( ucInsertedCardType & CT_BLOCK ) == 0 )
		{
			/* Convert to byte address if needed */
			ulSector *= mmcSECTOR_SIZE;
		}

		if( xCount == 1 )
		{
			/* Single block write */
			if( prvSendCommand( CMD24_WRITE_SINGLE_BLOCK, ulSector ) == 0 )
			{
				if( prvWriteDataBlock( pcBuffer, 0xFE ) == TRUE )
				{
					xCount = 0;
				}
			}
		}
		else
		{
			/* Multiple block write */
			if( ucInsertedCardType & CT_SDC )
			{
				prvSendCommand( CMD23_SET_ERASE_COUNT, xCount );
			}

			if( prvSendCommand( CMD25_WRITE_MULTI_BLOCK, ulSector ) == 0 )
			{
				do
				{
					if( prvWriteDataBlock( pcBuffer, 0xFC ) != TRUE )
					{
						break;
					}

					pcBuffer += mmcSECTOR_SIZE;

				} while( --xCount );

				if( prvWriteDataBlock( NULL, 0xFD ) != TRUE )
				{
					/* STOP_TRAN token */
					xCount = 1;
				}
			}
		}

		prvDeselectCard();

		if( xCount > 0 )
		{
			xReturn = RES_ERROR;
		}
		else
		{
			xReturn = RES_OK;
		}
	}

	return xReturn;
}
#endif /* _FS_READONLY == 0 */

#if _USE_IOCTL != 0
DRESULT disk_ioctl
		(
			BYTE	cDriveNumber,	/* Physical drive nmuber (0) */
			BYTE	cControlCode,	/* Control code */
			void	*pvBuffer		/* Buffer to send/receive control data */
		)
{
DRESULT xResult = RES_ERROR;
BYTE	n, pcTempBuffer[ mmcMAX_QUERY_STRING_BYTES ], *pcExternalBuffer = pvBuffer;
WORD	usSize;

	/* Only one drive is supported. */
	configASSERT( cDriveNumber == 0 );

	/* Remove compiler warnings when configASSERT() is not defined. */
	( void ) cDriveNumber;

	if( boardSD_CARD_DETECT() == boardSD_CARD_INSERTED )
	{
		if( cControlCode == CTRL_POWER )
		{
			switch( *pcExternalBuffer )
			{
				case SUB_CTRL_POWER_SET_OFF:

