sdsxpln/TM4C129-discontinued/libraries/fatfs/port/FreeRTOS+IO/mmc.c
					if( prvCheckPower() == mmcPOWER_ON )
					{
						prvPowerOff();
					}

					xResult = RES_OK;
					break;


				case SUB_CTRL_POWER_SET_ON:

					prvPowerOn();
					xResult = RES_OK;
					break;


				case SUB_CTRL_POWER_GET:

					*( pcExternalBuffer + 1 ) = ( BYTE ) prvCheckPower();
					xResult = RES_OK;
					break;


				default:

					xResult = RES_PARERR;
					break;
			}
		}
		else
		{
			if( ( ( xDiskStatus & STA_NOINIT ) != 0 ) || ( prvIsDiskInserted() != pdTRUE ) )
			{
				xResult = RES_NOTRDY;
			}
			else
			{
				switch( cControlCode )
				{
					case CTRL_SYNC:

						/* Make sure that no pending write process. Do not remove
						this or written ulSector might not left updated. */
						if( prvSelectCard() == TRUE )
						{
							xResult = RES_OK;
							prvDeselectCard();
						}
						break;


					case GET_SECTOR_COUNT:

						/* Get number of sectors on the disk (DWORD) */
						if( prvQueryCard( CMD9_READ_CSD_REGISTER, 0, pcTempBuffer, 16 ) == TRUE )
						{
							if( ( pcTempBuffer[ 0 ] >> 6 ) == 1 )
							{
								/* SDC ver 2.00 */
								usSize = pcTempBuffer[ 9 ] + ( ( ( WORD ) pcTempBuffer[ 8 ] << 8 ) + 1 );
								*( DWORD * ) pvBuffer = ( DWORD ) usSize << 10UL;
							}
							else
							{
								/* SDC ver 1.XX or MMC */
								n = ( pcTempBuffer[ 5 ] & 15 ) + ( (pcTempBuffer[ 10 ] & 128 ) >> 7 ) + ( (pcTempBuffer[ 9 ] & 3 ) << 1 ) + 2;
								usSize = ( pcTempBuffer[ 8 ] >> 6 ) + ( ( WORD ) pcTempBuffer[ 7 ] << 2 ) + ( ( WORD ) ( pcTempBuffer[ 6 ] & 3 ) << 10 ) + 1;
								*( DWORD * ) pvBuffer = ( DWORD ) usSize << ( n - 9 );
							}

							xResult = RES_OK;
						}
						break;


					case GET_SECTOR_SIZE:

						/* Get R/W ulSector size (WORD) */
						* ( WORD * ) pvBuffer = mmcSECTOR_SIZE;
						xResult = RES_OK;
						break;


					case GET_BLOCK_SIZE:

						/* Get erase block size in unit of ulSector (DWORD) */
						if( ( ucInsertedCardType & CT_SD2 ) != 0 )
						{
							/* SDC ver 2.00 */
							if( prvQueryCard( CMD13_READ_SD_STATUS, 0, pcTempBuffer, mmcMAX_QUERY_STRING_BYTES ) == TRUE )
							{
								* ( DWORD * ) pvBuffer = 16UL << ( pcTempBuffer[ 10 ] >> 4 );
								xResult = RES_OK;

								/* Only 16 of the 64 bytes have been read.  Purge
								the remaining bytes.  Read bytes 16 to 32. */
								FreeRTOS_read( xSPIPort, pcTempBuffer, mmcMAX_QUERY_STRING_BYTES );

								/* Read bytes 32 to 48. */
								FreeRTOS_read( xSPIPort, pcTempBuffer, mmcMAX_QUERY_STRING_BYTES );

								/* Read bytes 48 to 64. */
								FreeRTOS_read( xSPIPort, pcTempBuffer, mmcMAX_QUERY_STRING_BYTES );
							}
						}
						else
						{
							/* SDC ver 1.XX or MMC */
							if( prvQueryCard( CMD9_READ_CSD_REGISTER, 0, pcTempBuffer, 16 ) == TRUE )
							{
								/* Read CSD */
								if( ( ucInsertedCardType & CT_SD1 ) != 0 )
								{
									/* SDC ver 1.XX */
									*( DWORD * ) pvBuffer = ( ( ( pcTempBuffer[ 10 ] & 63 ) << 1 ) + ( ( WORD ) ( pcTempBuffer[ 11 ] & 128 ) >> 7 ) + 1 ) << ( ( pcTempBuffer[ 13 ] >> 6 ) - 1 );
								}
								else
								{
									/* MMC */
									*( DWORD * ) pvBuffer = ( ( WORD ) ( ( pcTempBuffer[ 10 ] & 124 ) >> 2 ) + 1 ) * ( ( ( pcTempBuffer[ 11 ] & 3 ) << 3 ) + ( ( pcTempBuffer[ 11 ] & 224 ) >> 5 ) + 1 );
								}

								xResult = RES_OK;
							}
						}
						break;


					case MMC_GET_TYPE:

						/* Get card type flags (1 byte) */
						*pcExternalBuffer = ucInsertedCardType;
						xResult = RES_OK;
						break;


					case MMC_GET_CSD:

						/* Receive CSD as a data block (16 bytes) */
						if( prvQueryCard( CMD9_READ_CSD_REGISTER, 0, pcExternalBuffer, 16 ) == TRUE )
						{
							xResult = RES_OK;
						}
						break;


					case MMC_GET_CID:

						/* Receive CID as a data block (16 bytes) */
						if( prvQueryCard( CMD10_READ_CID_REGISTER, 0, pcExternalBuffer, 16 ) == TRUE )
						{
							xResult = RES_OK;
						}
						break;


					case MMC_GET_OCR:

						/* Receive OCR as an R3 resp (4 bytes) */
						if( prvSendCommand( CMD58_READ_OCR, 0 ) == 0 )
						{
							/* READ_OCR */
							FreeRTOS_read( xSPIPort, pcExternalBuffer, mmcOCR_LENGTH );

							xResult = RES_OK;
						}
						break;


					case MMC_GET_SDSTAT:

						/* Receive SD status as a data block (64 bytes) */
						if( prvQueryCard( CMD13_READ_SD_STATUS, 0, pcExternalBuffer, 64 ) == TRUE )
						{
							xResult = RES_OK;
						}

						break;


					default:

						xResult = RES_PARERR;
				}
			}

			prvDeselectCard();
		}
	}
	else
	{
		xResult = RES_NOTRDY;
	}

	return xResult;
}
#endif /* _USE_IOCTL != 0 */

DWORD get_fattime()
{
	/* This function is provided to allow the FAT file system to compiler.  The
	time stamps are not implemented. */
	return 0UL;
}

/*-----------------------------------------------------------------------*/
/* The handle of the SSP/SPI port used by this driver is private to this file.
 * This is a simple access function that allows the handle to be obtained
 * externally.  This is done purely to allow an external file to change the
 * transfer mode used by the SPI port (for example, to change it from the
 * default polled mode to an interrupt driven mode).
 */
/*-----------------------------------------------------------------------*/
Peripheral_Descriptor_t xMMCGetSPIPortHandle( void )
{
	return xSPIPort;
}
/*-----------------------------------------------------------*/

/*-----------------------------------------------------------------------*/
/* Miscellaneous Functions                                               */
/*-----------------------------------------------------------------------*/

static portBASE_TYPE prvIsDiskInserted( void )
{
portBASE_TYPE xReturn;

	if( boardSD_CARD_DETECT() != boardSD_CARD_INSERTED )
	{
		xDiskStatus |= STA_NODISK;
		xReturn = pdFALSE;
	}
	else
	{
		xDiskStatus &= ~STA_NODISK;
		xReturn = pdTRUE;
	}

	return xReturn;
}
/*-----------------------------------------------------------*/

static BYTE prvSendCommand( BYTE cCommand,	DWORD xArgument	)
{
BYTE cResult = 0, n;
BYTE cCommandString[ mmcCOMMAND_LENGTH_BYTES ];

