sdsxpln/TM4C129-discontinued/libraries/fatfs/port/FreeRTOS+IO/mmc.c
	if( ( cCommand & 0x80 ) != 0 )
	{
		/* ACMD<n> is the command sequence of CMD55_LEADING_COMMAND_OF_ACMD-CMD<n> */
		cCommand &= 0x7F;
		cResult = prvSendCommand( CMD55_LEADING_COMMAND_OF_ACMD, 0 );
	}

	if( cResult <= 1 )
	{
		cResult = 0xff;

		/* Select the card and wait for ready */
		prvDeselectCard();
		if( prvSelectCard() == TRUE )
		{
			/* Send command packet */
			cCommandString[ 0 ] = cCommand;
			cCommandString[ 1 ] = ( BYTE ) ( ( xArgument >> 24UL ) & 0xffUL );
			cCommandString[ 2 ] = ( BYTE ) ( ( xArgument >> 16UL ) & 0xffUL );
			cCommandString[ 3 ] = ( BYTE ) ( ( xArgument >> 8UL ) & 0xffUL );
			cCommandString[ 4 ] = ( BYTE ) ( xArgument & 0xffUL );

			if( cCommand == CMD0_SOFTWARE_RESET )
			{
				/* Valid CRC for CMD0_SOFTWARE_RESET(0) */
				cCommandString[ 5 ] = 0x95;
			}
			else if( cCommand == CMD8_CHECK_VOLTAGE_RANGE )
			{
				/* Valid CRC for CMD8_CHECK_VOLTAGE_RANGE(0x1AA) */
				cCommandString[ 5 ] = 0x87;
			}
			else
			{
				/* Dummy CRC and stop. */
				cCommandString[ 5 ] = 0x01;
			}

			/* Ensure previous writes are complete before writing the command.
			This call only has an effect when the zero copy Tx mode is being
			used. */
			if( FreeRTOS_ioctl( xSPIPort, ioctlOBTAIN_WRITE_MUTEX, mmc500ms ) == pdPASS )
			{
				if( FreeRTOS_write( xSPIPort, cCommandString, mmcCOMMAND_LENGTH_BYTES ) == mmcCOMMAND_LENGTH_BYTES )
				{
					/* Receive command response */
					if( cCommand == CMD12_STOP )
					{
						/* Skip a stuff byte when stop reading */
						FreeRTOS_read( xSPIPort, &cResult, sizeof( cResult ) );
					}

					/* Wait for a valid response. */
					for( n = 0; n < 10; n++ )
					{
						if( FreeRTOS_read( xSPIPort, &cResult, sizeof( cResult ) ) == sizeof( cResult ) )
						{
							if( ( cResult & 0x80 ) == 0 )
							{
								break;
							}
						}
					}
				}
			}
		}
	}

	return cResult;
}
/*-----------------------------------------------------------*/

static Peripheral_Descriptor_t prvConfigureSDInterface( void )
{
static Peripheral_Descriptor_t xLocalSPIPort = NULL;

	if( xLocalSPIPort == NULL )
	{
		//boardCONFIGURE_SD_CARD_CS_PINS();
		boardSD_CARD_DEASSERT_CS();

		/* Open the SSP port used for writing to the SD card.  The second parameter
		(ulFlags) is not used in this case. */
		xLocalSPIPort = FreeRTOS_open( boardSD_CARD_SSP_PORT, ( uint32_t ) mmcPARAMETER_NOT_USED );
		configASSERT( xLocalSPIPort );

		/* At the time of writing, by default, the SSP will open all its parameters
		set correctly for communicating with the SD card, but explicitly set all
		parameters anyway, in case the defaults	changes in the future.  The clock
		frequency is set within the driver itself as it switches between the fast
		clock and the slow clock. */
		if( xLocalSPIPort != NULL )
		{
			FreeRTOS_ioctl( xLocalSPIPort, ioctlSET_SPI_DATA_BITS, 		( void * ) boardSSP_DATABIT_8 );
			FreeRTOS_ioctl( xLocalSPIPort, ioctlSET_SPI_MODE, 			( void * ) boardSPI_MASTER_MODE );
			FreeRTOS_ioctl( xLocalSPIPort, ioctlSET_SSP_FRAME_FORMAT, 	( void * ) boardSSP_FRAME_SPI );
		}
	}

	return xLocalSPIPort;
}
/*-----------------------------------------------------------*/

static BYTE prvWaitForCardReady (void)
{
portTickType xTimeOnEntering;
const portTickType xMaxTimeToWait_ms = 1000 / portTICK_RATE_MS;
BYTE cDummy;

	xTimeOnEntering = xTaskGetTickCount();

	FreeRTOS_read( xSPIPort, &cDummy, sizeof( cDummy ) );
	do
	{
		FreeRTOS_read( xSPIPort, &cDummy, sizeof( cDummy ) );
	}
	while( ( cDummy != 0xFF ) && ( ( xTaskGetTickCount() - xTimeOnEntering ) < xMaxTimeToWait_ms ) );

	return cDummy;
}
/*-----------------------------------------------------------*/

static void prvDeselectCard( void )
{
char cDummy;

	boardSD_CARD_DEASSERT_CS();
	FreeRTOS_read( xSPIPort, &cDummy, sizeof( cDummy ) );
}
/*-----------------------------------------------------------*/

static BOOL prvSelectCard( void )
{
BOOL xReturn = TRUE;

	boardSD_CARD_ASSERT_CS();
	if( prvWaitForCardReady() != 0xFF )
	{
		prvDeselectCard();
		xReturn = FALSE;
	}

	return xReturn;
}
/*-----------------------------------------------------------*/

static int prvCheckPower( void )
{
	/* Socket power state: 0=off, 1=on */
	return mmcPOWER_ON;
}
/*-----------------------------------------------------------*/

static BOOL prvQueryCard( BYTE ucCommand, DWORD ulCommandArgument, BYTE *pucRxBuffer, UINT uiRxLength )
{
BOOL xReturn = FALSE;
portTickType xTimeAtStart;
const portTickType xTimeOut = 200 / portTICK_RATE_MS;
BYTE cDummy[ 2 ];
BYTE cTimedOut = ( BYTE ) pdFALSE;

	/* The length must be a multiple of 4. */
	configASSERT( ( uiRxLength % 4 ) == 0U );
	configASSERT( xSPIPort );

	if( prvSendCommand( ucCommand, ulCommandArgument ) <= 1 )
	{
		xTimeAtStart = xTaskGetTickCount();

		do
		{
			FreeRTOS_read( xSPIPort, pucRxBuffer, sizeof( *pucRxBuffer ) );

			if( ( xTaskGetTickCount() - xTimeAtStart ) > xTimeOut )
			{
				cTimedOut = ( BYTE ) pdTRUE;
			}

		} while( ( ( *pucRxBuffer ) != 0xfeU ) && ( cTimedOut == pdFALSE ) );

		if( cTimedOut != pdTRUE )
		{
			/* Read data. */
			if( FreeRTOS_read( xSPIPort, pucRxBuffer, uiRxLength ) == uiRxLength )
			{
				/* Read and discard CRC. */
				FreeRTOS_read( xSPIPort, &cDummy, sizeof( cDummy ) );
				xReturn = TRUE;
			}
		}
	}

	return xReturn;
}
/*-----------------------------------------------------------*/

static BOOL prvReceiveDataBlock( BYTE *pcBuffer, UINT xBytesToRead )
{
BOOL xReturn = FALSE;
portTickType xTimeOnEntering;
BYTE pcToken[ 2 ] = { 0x00, 0x00 };
const portTickType xMaxTimeToWait_ms = 200 / portTICK_RATE_MS;

	xTimeOnEntering = xTaskGetTickCount();

	/* Wait with timeout for a valid byte. */
	do
	{
		FreeRTOS_read( xSPIPort, pcToken, sizeof( *pcToken ) );
	} while( ( *pcToken == 0xff ) && ( ( xTaskGetTickCount() - xTimeOnEntering ) < xMaxTimeToWait_ms ) );

	/* Was the byte as expected? */
	if( *pcToken == 0xfe )
	{
		/* Receive the data block. */
		if( FreeRTOS_read( xSPIPort, pcBuffer, xBytesToRead ) == xBytesToRead )
		{
			/* Read and discard the CRC. */
			FreeRTOS_read( xSPIPort, pcToken, sizeof( pcToken ) );
			xReturn = TRUE;
		}
	}

	return xReturn;
}
/*-----------------------------------------------------------*/

#if _FS_READONLY == 0
static BOOL prvWriteDataBlock( const BYTE *pcBuffer, BYTE cToken )
{
/* Two dummy CRC bytes, and one space to receive the response. */
const BYTE cCRCDummy[ 2 ] = { 0xff, 0xff };
volatile BOOL bReturn = FALSE;

	if( prvWaitForCardReady() == 0xff )
	{
		/* Transmit the token. */
		if( FreeRTOS_ioctl( xSPIPort, ioctlOBTAIN_WRITE_MUTEX, mmc500ms ) == pdPASS )
		{
			if( FreeRTOS_write( xSPIPort, &cToken, sizeof( cToken ) ) == 1 )
			{
				if( cToken != 0xFD )
				{
					if( FreeRTOS_ioctl( xSPIPort, ioctlOBTAIN_WRITE_MUTEX, mmc500ms ) == pdPASS )
					{
						/* Write the data block. */
						if( FreeRTOS_write( xSPIPort, pcBuffer, mmcDATA_BLOCK_SIZE ) == mmcDATA_BLOCK_SIZE )
						{
							if( FreeRTOS_ioctl( xSPIPort, ioctlOBTAIN_WRITE_MUTEX, mmc500ms ) == pdPASS )
							{
								/* Write the CRC. */
								if( FreeRTOS_write( xSPIPort, cCRCDummy, sizeof( cCRCDummy ) ) == sizeof( cCRCDummy ) )
								{
									/* Receive response. */
									if( FreeRTOS_read( xSPIPort, &cToken, sizeof( cToken ) ) == sizeof( cToken ) )
									{
										if( ( cToken & 0x1f ) == 0x05 )
										{
											bReturn = TRUE;
										}
									}
								}
							}
						}
					}
				}
				else
				{
					bReturn = TRUE;
				}
			}
		}
	}

	configASSERT( bReturn );
	return bReturn;
}
#endif /* _FS_READONLY */
/*-----------------------------------------------------------*/